Repository: ioi-isr/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: he

source: Error loading details, please refresh the page.
he: שגיאה בטעינת הפרטים, אנא רעננו את הדף.

source: Evaluation system error
he: שגיאת במערכת הבדיקה

source: Fair
he: בינונית

source: Forgot password?
he: שכחתם סיסמה?

source: If you don't receive the email within a few minutes, please check your spam folder.
he: אם לא קיבלתם את האימייל תוך מספר דקות, אנא בדקו את תיקיית הספאם.

source: Image dimensions are too large. Maximum is 1280x1280 pixels.
he: מידות התמונה גדולות מדי. המקסימום הוא 1280x1280 פיקסלים.

source: Image file is too large. Maximum size is 5MB.
he: קובץ התמונה גדול מדי. הגודל המקסימלי הוא 5MB.

source: Invalid image type. Allowed types: JPEG, PNG, GIF, WEBP.
he: סוג תמונה לא חוקי. סוגים מותרים: JPEG, PNG, GIF, WEBP.

source: Invalid or Expired Link
he: קישור לא חוקי או שפג תוקפו

source: New Password
he: סיסמה חדשה

source: Once you start, you will be able to view tasks and submit solutions until the end of the contest.
he: לאחר שתתחילו, תוכלו לצפות במשימות ולהגיש פתרונות עד סוף התחרות.

source: Password Reset
he: איפוס סיסמה

source: Password Reset Submitted!
he: בקשת איפוס הסיסמה נשלחה!

source: Password strength:
he: חוזק הסיסמה:

source: Pending
he: ממתין

source: Please check your email and click the link to reset your password. The link will expire in
he: אנא בדקו את האימייל שלכם ולחצו על הקישור לאיפוס הסיסמה. הקישור יפוג בעוד

source: Please contact an administrator if you need your password reset to be processed urgently.
he: אנא פנו למנהל מערכת אם אתם צריכים שאיפוס הסיסמה שלכם יטופל בדחיפות.

source: Please enter a valid date of birth.
he: אנא הזינו תאריך לידה תקין.

source: Please enter a valid email address.
he: אנא הזינו כתובת אימייל תקינה.

source: Please explain why you need a delay
he: אנא הסבירו מדוע אתם צריכים דחייה

source: Please request a new password reset link if you still need to reset your password.
he: אנא בקשו קישור חדש לאיפוס סיסמה אם אתם עדיין צריכים לאפס את הסיסמה.

source: Profile picture
he: תמונת פרופיל

source: Reason
he: סיבה

source: Reason:
he: סיבה:

source: Rejected
he: נדחתה

source: Rejection Reason:
he: סיבת הדחייה:

source: Request Contest Delay
he: בקשת דחיית תחרות

source: Request New Reset Link
he: בקשת קישור איפוס חדש

source: Request Reset
he: בקשת איפוס

source: Requested Start Time
he: זמן התחלה מבוקש

source: Requested Start Time:
he: זמן התחלה מבוקש:

source: Reset Password
he: איפוס סיסמה

source: Select target language
he: בחרו שפת יעד

source: Select the date and time when you want to start the contest
he: בחרו את התאריך והשעה שבהם תרצו להתחיל את התחרות

source: Some of the registration data is invalid. Please check all fields.
he: חלק מנתוני ההרשמה אינם תקינים. אנא בדקו את כל השדות.

source: Source Language
he: שפת מקור

source: Status:
he: סטטוס:

source: Strong
he: חזקה

source: Submit Delay Request
he: שליחת בקשת דחייה

source: Supported Languages
he: שפות נתמכות

source: Target Language
he: שפת יעד

source: Text to Translate
he: טקסט לתרגום

source: Thank you for your participation!
he: תודה על השתתפותכם!

source: The uploaded file is not a valid image.
he: הקובץ שהועלה אינו תמונה תקינה.

source: This password reset link is invalid or has expired.
he: קישור איפוס הסיסמה אינו חוקי או שפג תוקפו.

source: Translate
he: תרגמו

source: Translation
he: תרגום

source: Translation Result
he: תוצאת התרגום

source: Use this tool to translate text between different languages. This can help you understand problem statements and communicate more effectively.
he: השתמשו בכלי זה לתרגום טקסט בין שפות שונות. זה יכול לעזור לכם להבין הצהרות בעיות ולתקשר בצורה יעילה יותר.

source: Username may not start with __.
he: שם המשתמש לא יכול להתחיל ב-__.

source: Username may only contain letters, digits, underscores, and hyphens.
he: שם המשתמש יכול להכיל רק אותיות, ספרות, קווים תחתונים ומקפים.

source: Username or Email
he: שם משתמש או אימייל

source: Very strong
he: חזקה מאוד

source: Very weak
he: חלשה מאוד

source: Weak
he: חלשה

source: You haven't started the contest yet.
he: עדיין לא התחלתם את התחרות.

source: You missed the contest window.
he: פספסתם את חלון התחרות.

source: Your password is too weak. Try using a longer phrase with a mix of letters, numbers, and symbols.
he: הסיסמה שלכם חלשה מדי. נסו להשתמש בביטוי ארוך יותר עם שילוב של אותיות, מספרים וסמלים.

source: Your password reset request for user
he: בקשת איפוס הסיסמה שלכם עבור המשתמש

source: has been submitted.
he: נשלחה.

source: hours.
he: שעות.

source: All
he: הכל

source: Assigned
he: הוקצה

source: Attempted
he: נוסה

source: Back to Training Program
he: חזרה לתוכנית האימונים

source: Current start time:
he: זמן התחלה נוכחי:

source: Date
he: תאריך

source: Delay request actions
he: פעולות בקשת דחייה

source: Description
he: תיאור

source: Duration:
he: משך:

source: ENDED
he: הסתיים

source: Enter Training
he: כניסה לאימון

source: Filter:
he: סינון:

source: Go to statement
he: מעבר לסטייטמנט

source: Go to submissions
he: מעבר להגשות

source: H:
he: ב:

source: Home Score
he: ניקוד בית

source: LIVE
he: פעיל

source: Manual
he: ידני

source: No ongoing or upcoming trainings.
he: אין אימונים פעילים או עתידיים.

source: No past trainings yet.
he: אין עדיין אימונים קודמים.

source: No tasks
he: אין משימות

source: No tasks available yet.
he: אין עדיין משימות זמינות.

source: Not Attempted
he: לא נוסה

source: Ongoing and Upcoming Trainings
he: אימונים פעילים ועתידיים

source: Overall Completion Rate
he: אחוז השלמה כולל

source: Partial
he: חלקי

source: Past Trainings
he: אימונים קודמים

source: Request a Delay
he: בקשת דחייה

source: Request a delay for this training day
he: בקשת דחייה עבור יום אימון זה

source: Scoreboard
he: טבלת ניקוד

source: Solved
he: נפתר

source: Source
he: מקור

source: Start:
he: התחלה:

source: Starts in:
he: מתחיל בעוד:

source: Statistics
he: סטטיסטיקות

source: Submissions from training day: %(td_desc)s
he: הגשות מיום אימון: %(td_desc)s

source: Submissions from task archive
he: הגשות מארכיון המשימות

source: T:
he: א:

source: TOTAL POINTS
he: סה״כ נקודות

source: Task Archive
he: ארכיון משימות

source: Tasks
he: משימות

source: Training Days
he: ימי אימון

source: Training Score
he: ניקוד אימון

source: Upcoming Training Days
he: ימי אימון עתידיים

source: View %(count)s delay request(s)
he: צפייה ב-%(count)s בקשות דחייה

source: View Requests
he: צפייה בבקשות

source: YOUR SCORE
he: הניקוד שלך

source: Your Delay Requests
he: בקשות הדחייה שלך
