Repository: ioi-isr/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: he

source: Not correct
he: שגוי

source: Correct
he: נכון

source: Partially correct
he: נכון חלקית

source: Outcome
he: תוצאה

source: Details
he: פרטים

source: Execution time
he: זמן ריצה

source: Memory used
he: זיכרון שהשתמשתם בו

source: Score details temporarily unavailable.
he: פרטי הניקוד אינם זמינים באופן זמני.

source: Subtask %(index)s
he: תת משימה %(index)s

source: Compilation succeeded
he: הקומפילציה עברה בהצלחה

source: Your submission successfully compiled to an executable.
he: ההגשה שלכם התקמפלה בהצלחה לקובץ הרצה.

source: Compilation failed
he: הקומפילציה נכשלה

source: Your submission did not compile correctly.
he: ההגשה שלכם לא התקמפלה בהצלחה.

source: Compilation timed out
he: הקומפילציה חרגה מהזמן המוקצב

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
he: ההגשה שלכם חרגה ממגבלת הזמן בעת הקמפול. זה עלול להגרם על ידי שימוש יתר ב-templates של C++, למשל.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
he: הקמפול הופסק בעקבות האות %s (ייתכן שעקב חריגה ממגבלות הזכרון)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
he: ההגשה שלך הופסקה בעקבות האות שצוין. בין היתר, ייתכן שזה נגרם עקב חריגה ממגבלת הזיכרון בזמן הקומפילציה, למשל עקב שימוש מופרז בתבניות ++C.

source: Output is correct
he: הפלט נכון

source: Your submission ran and gave the correct answer
he: ההגשה שלך הורצה וסיפקה את התשובה הנכונה

source: Output is partially correct
he: הפלט נכון חלקית

source: Your submission ran and gave the partially correct answer
he: ההגשה שלך הורצה וסיפקה תשובה נכונה חלקית

source: Output isn't correct
he: הפלט שגוי

source: Your submission ran, but gave the wrong answer
he: ההגשה שלך הורצה, אך סיפקה תשובה שגויה

source: Evaluation didn't produce file %s
he: ההרצה לא יצרה את הקובץ %s

source: Your submission ran, but did not write on the correct output file
he: ההגשה שלך רצה, אך לא כתבה לקובץ הפלט הנכון

source: Execution timed out
he: חריגה ממגבלת הזמן

source: Your submission used too much CPU time.
he: ההגשה שלך השתמשה ביותר מידי זמן מעבד.

source: Execution timed out (wall clock limit exceeded)
he: חריגה ממגבלת הזמן (שעון קיר)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
he: ההגשה שלכם השתמשה ביותר מידי זמן כולל. זה יכול להגרם עקב קוד לא מוגדר, או גלישת זכרון, למשל. שימו לב שבמקרה זה זמן המעבד הנראה בפרטי ההגשה עלול להיות קטן ממגבלת זמן הריצה.

source: Memory limit exceeded
he: חריגה ממגבלת הזכרון

source: Your submission used too much memory.
he: ההגשה שלכם השתמשה ביותר מידי זכרון.

source: Execution killed by signal
he: הריצה הופסקה על ידי אות

source: The evaluation was killed by a signal.
he: ההרצה הופסקה על ידי אות.

source: Execution failed because the return code was nonzero
he: ההרצה נכשלה כי ערך החזרה היה שונה מאפס

source: Your submission failed because it exited with a return code different from 0.
he: ההגשה שלכם נכשלה כי היא יצאה עם ערך חזרה שונה מ-0.

source: Execution completed successfully
he: הריצה הסתיימה בהצלחה

source: No compilation needed
he: אין צורך בקומפילציה

source: File not submitted
he: הקובץ לא הוגש

source: Question too long!
he: השאלה ארוכה מידי!

source: Subject must be at most %(max_subject_length)d characters, content at most %(max_text_length)d.
he: הנושא חייב להיות בעל לכל היותר %(max_subject_length)d תוים, והתוכן לכל היותר %(max_text_length)d.

source: contest-token
he: אסימון-תחרות

source: contest-tokens
he: אסימוני-תחרות

source: task-token
he: אסימון-משימה

source: task-tokens
he: אסימוני-משימה

source: token
he: אסימון

source: tokens
he: אסימונים

source: You don't have %(type_pl)s available for this task.
he: אין לכם %(type_pl)s זמינים עבור משימה זו.

source: You have an infinite number of %(type_pl)s for this task.
he: יש לכם מספר אינסופי של %(type_pl)s עבור משימה זו.

source: You start with no %(type_pl)s.
he: אתם מתחילים בלי %(type_pl)s.

source: You start with one %(type_s)s.
he: אתם מתחילים עם %(type_s)s יחיד.

source: Every minute
he: כל דקה

source: you get another %(type_s)s,
he: אתם מקבלים %(type_s)s נוסף,

source: up to a maximum of one %(type_s)s.
he: עד למקסימום של %(type_s)s יחיד.

source: you get another %(type_s)s.
he: תקבלו %(type_s)s נוסף.

source: You don't get other %(type_pl)s.
he: לא תקבלו %(type_pl)s נוספים.

source: You can use a %(type_s)s every second
he: אתם יכולים להשתמש ב- %(type_s)s בכל שניה

source: and no more than one %(type_s)s in total.
he: ובלא יותר מ-%(type_s)s בסך הכל.

source: You can use a %(type_s)s every second.
he: אתם יכולים להשתמש ב-%(type_s)s בכל שניה.

source: You can use no more than one %(type_s)s in total.
he: אתם יכולים להשתמש בלא יותר מ-%(type_s)s בסך הכל.

source: You have no limitations on how you use them.
he: אין לכם מגבלות באיך להשתמש בהם.

source: Question received
he: השאלה התקבלה

source: Your question has been received, you will be notified when it is answered.
he: השאלה שלכם התקבלה, תקבלו התראה כשהיא תענה.

source: Print job received
he: עבודת ההדפסה התקבלה

source: Your print job has been received.
he: עבודת ההדפסה שלכם התקבלה.

source: Submission received
he: ההגשה התקבלה

source: Your submission has been received and is currently being evaluated.
he: ההגשה שלכם התקבלה וכעת נבדקת.

source: Compiling...
he: מתקמפלת...

source: Evaluating...
he: נבדקת...

source: Scoring...
he: מנוקדת...

source: Evaluated
he: נבדקה

source: status
he: סטטוס

source: Token request received
he: הבקשה לאסימונים התקבלה

source: Your request has been received and applied to the submission.
he: הבקשה שלכם התקבלה ומושמת להגשה.

source: Test received
he: הטסט התקבל

source: Your test has been received and is currently being executed.
he: הטסט שלכם התקבל וכרגע מורץ.

source: details
he: פרטים

source: Executing...
he: מורצת...

source: Executed
he: הורצה

source: Too many print jobs!
he: יותר מידי עבודות הדפסה!

source: You have reached the maximum limit of at most %d print jobs.
he: הגעתם למגבלה המירבית של לכל היותר %d עבודות הדפסה.

source: Invalid format!
he: פורמט לא תקין!

source: Please select the correct files.
he: אנא בחרו את הקבצים הנכונים.

source: File too big!
he: הקובץ גדול מידי!

source: Each file must be at most %d bytes long.
he: על כל קובץ להיות באורך של לכל היותר %d בתים.

source: Print job storage failed!
he: האכסון של עבודת ההדפסה נכשל!

source: Please try again.
he: אנא נסו שוב.

source: Too many submissions!
he: יותר מידי הגשות!

source: You have reached the maximum limit of at most %d submissions among all tasks.
he: הגעתם למגבלה המירבית של לכל היותר %d הגשות על פני כל המשימות.

source: You have reached the maximum limit of at most %d submissions on this task.
he: הגעתם למגבלה של לכל היותר %d הגשות במשימה זו.

source: Submissions too frequent!
he: ההגשות דכופות מידי!

source: Among all tasks, you can submit again after %d seconds from last submission.
he: על פני כל המשימות, אתם יכולים להגיש שוב לאחר %d שניות מההגשה האחרונה שלכם.

source: For this task, you can submit again after %d seconds from last submission.
he: עבור משימה זו, אתם יכולים להגיש שוב לאחר %d שניות מההגשה האחרונה שלכם.

source: Submission too big!
he: ההגשה גדולה מידי!

source: Each source file must be at most %d bytes long.
he: על כל קובץ קוד להיות באורך של לכל היותר %d בתים.

source: The submission should contain at most %d files.
he: על ההגשה להכיל לכל היותר %d קבצים.

source: Invalid archive format!
he: פורמט ארכיון לא תקין!

source: The submitted archive could not be opened.
he: הארכיון שהוגש לא יכל להפתח.

source: Invalid submission format!
he: פורמט הגשה לא תקין!

source: Submission storage failed!
he: אכסון ההגשה נכשל!

source: Too many tests!
he: יותר מידי טסטים!

source: You have reached the maximum limit of at most %d tests among all tasks.
he: הגעתם למגבלה של לכל היותר %d טסטים על פני כל המשימות.

source: You have reached the maximum limit of at most %d tests on this task.
he: הגעתם למגבלה של לכל היותר %d טסטים במשימה זו.

source: Tests too frequent!
he: הטסטים תכופים מידי!

source: Among all tasks, you can test again after %d seconds from last test.
he: על פני כל המשימות, אתם יכולים להגיש טסט שוב כעבור %d שניות מאז הטסט האחרון.

source: For this task, you can test again after %d seconds from last test.
he: במשימה זו, אתם יכולים להגיש טסט שוב כעבור %d שניות מאז הטסט האחרון.

source: Invalid test format!
he: פורמט טסט לא תקין!

source: Test too big!
he: הטסט גדול מידי!

source: Input too big!
he: הקלט גדול מידי!

source: The input file must be at most %d bytes long.
he: על קובץ הקלט להיות לכל היותר באורך %d בתים.

source: Test storage failed!
he: אכסון הטסט נכשל!

source: Communication
he: תקשורת

source: Announcements
he: הכרזות

source: (no subject)
he: (ללא נושא)

source: Questions
he: שאלות

source: Subject
he: נושא

source: Text
he: טקסט

source: Ask question
he: שאלו שאלה

source: Reset
he: אתחול

source: no answer yet
he: עדיין אין תשובה

source: Messages
he: הודעות

source: Automatic (%(lang)s)
he: אוטומטית (%(lang)s)

source: Logout
he: התנתקות

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
he: מחובר כ-<strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
he: ההתחברות נכשלה.

source: Welcome
he: ברוכים הבאים

source: Please log in
he: אנא התחברו

source: Username
he: שם משתמש

source: Password
he: ססמה

source: Login
he: התחברות

source: Don't have an account?
he: אין לכם משתמש?

source: Register
he: הרשמה

source: New message
he: הודעה חדשה

source: New announcement
he: הכרזה חדשה

source: New answer
he: תשובה חדשה

source: %d unread
he: %d לא נקראו

source: Until contest starts:
he: עד תחילת התחרות:

source: Until contest ends:
he: עד סוף התחרות:

source: Until analysis starts:
he: עד תחילת האנליסיס:

source: Until analysis ends:
he: עד סוף האנליסיס:

source: Time left:
he: זמן שנשאר:

source: Server time:
he: זמן השרת:

source: Overview
he: סקירה כללית

source: Statement
he: סטייטמנט

source: Submissions
he: הגשות

source: Documentation
he: תיעוד

source: Testing
he: בדיקה

source: Printing
he: הדפסה

source: Contest Management System
he: מערכת ה-CMS

source: is released under the
he: משוחררת תחת ה-

source: GNU Affero General Public License
he: רישיון הציבור הכללי של GNU Affero

source: Choose a contest
he: בחרו תחרות

source: Programming languages and libraries
he: שפות תכנות וספריות

source: The main Java class of the solution should have exactly the same name as the task.
he: למחלקה הראשית ב-Java של הפתרון צריך להיות בדיוק אותו השם כמו שם המשימה.

source: Submission details for compilation
he: פרטי ההגשה לקומפילציה

source: Message
he: הודעה

source: Explanation
he: הסבר

source: Submission details for evaluation
he: פרטי ההגשה לבדיקה

source: Error %(status_code)s
he: שגיאה %(status_code)s

source: An error occured while the server was handling your request.
he: אירעה שגיאה בזמן שהשרת טיפל בבקשתכם.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
he: שימו לב שניסיונות לחבל במערכת ניהול התחרויות (כגון בדיקת השרת עם כתובות URL מותאמות אישית) עלולים להיחשב כרמאות ולהוביל לפסילה.

source: If you encountered this error during normal usage, please notify the contest administrators.
he: אם נתקלתם בשגיאה זו במהלך שימוש רגיל, אנא הודיעו למנהלי התחרות.

source: Public score
he: ניקוד פומבי

source: Total score
he: ניקוד כולל

source: Score
he: ניקוד

source: Token
he: אסימון

source: no submissions
he: אין הגשות

source: Played
he: שוחק

source: Play!
he: שחקו!

source: No tokens
he: אין אסימונים

source: General information
he: מידע כללי

source: The contest hasn't started yet.
he: התחרות עדיין לא התחילה.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
he: התחרות תתחיל ב-%(start_time)s ותסתיים ב-%(stop_time)s.

source: The contest is currently running.
he: התחרות רצה כעת.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
he: התחרות התחילה ב-%(start_time)s ותסתיים ב-%(stop_time)s.

source: The contest has already ended.
he: התחרות כבר הסתיימה.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
he: התחרות התחילה ב-%(start_time)s והסתיימה ב-%(stop_time)s.

source: The analysis mode hasn't started yet.
he: מצב הניתוח עדיין לא התחיל.

source: The analysis mode will start at %(start_time)s and will end at %(stop_time)s.
he: מצב הניתוח יתחיל ב-%(start_time)s ויסתיים ב-%(stop_time)s.

source: The analysis mode is currently running.
he: מצב הניתוח פועל כעת.

source: The analysis mode started at %(start_time)s and will end at %(stop_time)s.
he: מצב הניתוח התחיל ב-%(start_time)s ויסתיים ב-%(stop_time)s.

source: The analysis mode has already ended.
he: מצב הניתוח כבר הסתיים.

source: The analysis mode started at %(start_time)s and ended at %(stop_time)s.
he: מצב הניתוח התחיל ב-%(start_time)s והסתיים ב-%(stop_time)s.

source: You have an infinite number of tokens.
he: יש לכם מספר אינסופי של אסימונים.

source: You can see the detailed result of a submission by using a token on it.
he: תוכלו לראות את התוצאה המפורטת של הגשה על ידי שימוש באסימון עליה.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
he: הניקוד שלכם עבור כל משימה יהיה המקסימום בין ההגשות עם אסימון לבין האחרונה.

source: You have a distinct set of tokens for each task.
he: יש לכם סט נפרד של אסימונים עבור כל משימה.

source: You can find the rules for the %(type_pl)s on each task's description page.
he: תוכלו למצוא את הכללים עבור %(type_pl)s בדף התיאור של כל משימה.

source: You have a set of tokens shared among all tasks.
he: יש לכם סט אסימונים משותף לכל המשימות.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
he: יש לכם שני סוגי אסימונים: סט של <em>אסימוני-תחרות</em> משותף לכל המשימות וסט נפרד של <em>אסימוני-משימה</em> עבור כל משימה.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
he: תוכלו לראות את התוצאה המפורטת של הגשה על ידי שימוש בשני אסימונים עליה, אחד מכל סוג.

source: You can submit at most %(submissions)s solutions during this contest.
he: תוכלו להגיש לכל היותר %(submissions)s פתרונות במהלך תחרות זו.

source: You can submit at most %(user_tests)s user tests during this contest.
he: תוכלו להגיש לכל היותר %(user_tests)s טסטים במהלך תחרות זו.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
he: כל משתמש רשאי להתחרות (כלומר להגיש פתרונות) למשך מסגרת זמן רציפה של %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
he: ברגע שהתחרות מתחילה תוכלו לבחור להתחיל את מסגרת הזמן שלכם.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
he: ברגע שתתחילו, תוכלו להגיש פתרונות עד סוף מסגרת הזמן או עד סוף התחרות, המוקדם מביניהם.

source: By clicking on the button below you can start your time frame.
he: על ידי לחיצה על הכפתור למטה תוכלו להתחיל את מסגרת הזמן שלכם.

source: You started your time frame at %(start_time)s.
he: התחלתם את מסגרת הזמן שלכם ב-%(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
he: תוכלו להגיש פתרונות עד סוף מסגרת הזמן או עד סוף התחרות, המוקדם מביניהם.

source: You started your time frame at %(start_time)s and you already finished it.
he: התחלתם את מסגרת הזמן שלכם ב-%(start_time)s וכבר סיימתם אותה.

source: There's nothing you can do now.
he: אין מה לעשות כעת.

source: You never started your time frame. Now it's too late.
he: מעולם לא התחלתם את מסגרת הזמן שלכם. עכשיו מאוחר מדי.

source: Start!
he: התחל!

source: Task overview
he: סקירת משימות

source: Task
he: משימה

source: Name
he: שם

source: Time limit
he: מגבלת זמן

source: Memory limit
he: מגבלת זיכרון

source: Type
he: סוג

source: Files
he: קבצים

source: Tokens
he: אסימונים

source: Yes
he: כן

source: No
he: לא

source: Print
he: הדפסה

source: You can print %(remaining_jobs)s more text or PDF files of up to %(max_pages)s pages each.
he: תוכלו להדפיס עוד %(remaining_jobs)s קבצי טקסט או PDF של עד %(max_pages)s עמודים כל אחד.

source: You can print %(remaining_jobs)s more text files of up to %(max_pages)s pages each.
he: תוכלו להדפיס עוד %(remaining_jobs)s קבצי טקסט של עד %(max_pages)s עמודים כל אחד.

source: File (text or PDF)
he: קובץ (טקסט או PDF)

source: File (text)
he: קובץ (טקסט)

source: Submit
he: שליחה

source: You cannot print anything any more as you have used up your printing quota.
he: אינכם יכולים להדפיס יותר כי ניצלתם את מכסת ההדפסה שלכם.

source: Previous print jobs
he: עבודות הדפסה קודמות

source: Date and time
he: תאריך ושעה

source: Time
he: זמן

source: File name
he: שם הקובץ

source: Status
he: סטטוס

source: Preparing...
he: מכין...

source: no print jobs yet
he: אין עבודות הדפסה עדיין

source: The passwords do not match!
he: הסיסמאות אינן תואמות!

source: This username is already taken, please choose a different one.
he: שם המשתמש הזה כבר תפוס, אנא בחרו אחר.

source: This user is already registered in the contest.
he: משתמש זה כבר רשום לתחרות.

source: No such user.
he: אין משתמש כזה.

source: The password is not correct.
he: הסיסמה אינה נכונה.

source: Registration
he: הרשמה

source: Please fill in the fields to register
he: אנא מלאו את השדות כדי להירשם

source: New user
he: משתמש חדש

source: Join contest
he: הצטרפות לתחרות

source: First name
he: שם פרטי

source: Last name
he: שם משפחה

source: E-mail
he: אימייל

source: Representing
he: מייצג

source: Must be one character or more.
he: חייב להיות תו אחד או יותר.

source: Confirm password
he: אימות סיסמה

source: Registered in the contest successfully!
he: נרשמתם לתחרות בהצלחה!

source: Your username is:
he: שם המשתמש שלכם:

source: Your password is stored securely.
he: הסיסמה שלכם מאוחסנת בצורה מאובטחת.

source: Back to login
he: חזרה להתחברות

source: Compilation output
he: פלט קומפילציה

source: Compilation outcome:
he: תוצאת קומפילציה:

source: Compilation time:
he: זמן קומפילציה:

source: Memory used:
he: זיכרון שנוצל:

source: Standard output
he: פלט סטנדרטי

source: Standard error
he: שגיאה סטנדרטית

source: %(name)s (%(short_name)s) <small>description</small>
he: %(name)s (%(short_name)s) <small>תיאור</small>

source: no statement available
he: אין סטייטמנט זמין

source: Download task statement
he: הורדת הסטייטמנט

source: The statement for this task is available in multiple versions, in different languages.
he: הסטייטמנט זמין במספר גרסאות, בשפות שונות.

source: You can see (and download) all of them using the list on the right.
he: תוכלו לראות (ולהוריד) את כולן באמצעות הרשימה מימין.

source: Some suggested translations follow.
he: להלן כמה תרגומים מוצעים.

source: Statement in <b>%(lang)s</b>
he: סטיימנט ב-<b>%(lang)s</b>

source: Statement in %(lang)s
he: סטיימנט ב-%(lang)s

source: Some details
he: כמה פרטים

source: Compilation commands
he: פקודות קומפילציה

source: You can find the rules for the %(type_pl)s on the <a href="%(contest_root)s">contest overview page</a>.
he: תוכלו למצוא את הכללים עבור %(type_pl)s ב<a href="%(contest_root)s">דף סקירת התחרות</a>.

source: Remember that to see the detailed result of a submission you need to use both a contest-token and a task-token.
he: זכרו שכדי לראות את התוצאה המפורטת של הגשה עליכם להשתמש גם באסימון-תחרות וגם באסימון-משימה.

source: Attachments
he: קבצים מצורפים

source: unknown
he: לא ידוע

source: loading...
he: טוען...

source: %(name)s (%(short_name)s) <small>submissions</small>
he: %(name)s (%(short_name)s) <small>הגשות</small>

source: Score:
he: ניקוד:

source: Public score:
he: ניקוד פומבי:

source: Score of tokened submissions:
he: ניקוד הגשות עם אסימון:

source: Total score:
he: ניקוד כולל:

source: Submit a solution
he: הגשת פתרון

source: You may submit any subset of outputs in a single submission.
he: תוכלו להגיש כל תת-קבוצה של פלטים בהגשה אחת.

source: You can submit %(submissions_left)s more solution(s).
he: תוכלו להגיש עוד %(submissions_left)s פתרונות.

source: Previous submissions
he: הגשות קודמות

source: Tokens are not allowed on this task.
he: אסימונים אינם מותרים במשימה זו.

source: Right now, you have infinite tokens available on this task.
he: כרגע, יש לכם אסימונים אינסופיים זמינים במשימה זו.

source: Right now, you have one token available on this task.
he: כרגע, יש לכם אסימון אחד זמין במשימה זו.

source: Right now, you have %(tokens)s tokens available on this task.
he: כרגע, יש לכם %(tokens)s אסימונים זמינים במשימה זו.

source: But you have to wait until %(expiration_time)s to use them.
he: אבל עליכם להמתין עד %(expiration_time)s כדי להשתמש בהם.

source: You will receive a new token at %(gen_time)s.
he: תקבלו אסימון חדש ב-%(gen_time)s.

source: In the current situation, no more tokens will be generated.
he: במצב הנוכחי, לא יופקו עוד אסימונים.

source: Right now, you do not have tokens available for this task.
he: כרגע, אין לכם אסימונים זמינים למשימה זו.

source: But you will have to wait until %(expiration_time)s to use it.
he: אבל תצטרכו להמתין עד %(expiration_time)s כדי להשתמש בו.

source: Unofficial submissions
he: הגשות לא רשמיות

source: Official submissions
he: הגשות רשמיות

source: Submission details
he: פרטי הגשה

source: Close
he: סגירה

source: Download
he: הורדה

source: Submit a test
he: הגשת טסט

source: You can submit %(user_tests_left)s more test(s).
he: תוכלו להגיש עוד %(user_tests_left)s טסטים.

source: input
he: קלט

source: Previous tests
he: הטסטים הקודמים

source: Input
he: קלט

source: Output
he: פלט

source: no tests yet
he: אין טסטים עדיין

source: Test details
he: פרטי הטסט

source: Evaluation outcome
he: תוצאת ההרצה

source: Wait...
he: המתינו...

source: Token request discarded
he: בקשת האסימון נדחתה

source: Your request has been discarded because you have no tokens available.
he: הבקשה שלכם נדחתה כי אין לכם אסימונים זמינים.

source: Your request has been discarded because you already used a token on that submission.
he: הבקשה שלכם נדחתה כי כבר השתמשתם באסימון על ההגשה הזו.

source: Invalid file
he: קובץ לא תקין

source: Print job has too many pages
he: עבודת ההדפסה מכילה יותר מדי עמודים

source: Sent to printer
he: נשלח למדפסת

source: A password reset link has been sent to:
he: קישור לאיפוס סיסמה נשלח אל:

source: An administrator must approve your password reset before it takes effect. You will be able to log in with your new password once it has been approved.
he: מנהל מערכת צריך לאשר את איפוס הסיסמה שלכם לפני שייכנס לתוקף. תוכלו להתחבר עם הסיסמה החדשה שלכם לאחר שתאושר.

source: Approved
he: מאושר

source: Before you can view the tasks and participate in the contest, you must click the button below to register your participation.
he: לפני שתוכלו לצפות במשימות ולהשתתף בתחרות, עליכם ללחוץ על הכפתור למטה כדי להתחיל את השתתפותכם.

source: Confirm Password
he: אימות סיסמה

source: Date of birth
he: תאריך לידה

source: Delay Request
he: בקשת דחייה

source: Detect Language
he: זיהוי שפה

source: Email Sent!
he: האימייל נשלח!

source: Email address is required.
he: נדרשת כתובת אימייל.

source: Enter Contest
he: כניסה לתחרות

source: Enter a new password for user:
he: הזינו סיסמה חדשה עבור המשתמש:

source: Enter the text you want to translate
he: הזינו את הטקסט שברצונכם לתרגם

source: Enter your username or email address to request a password reset.
he: הזינו את שם המשתמש או את כתובת האימייל שלכם כדי לבקש איפוס סיסמה.

source: Error
he: שגיאה
